package strings_task1;

public class MyExceptions {
    public static void main(String[] args) {
    /*
    Основное задание
1. Доработать нулевое домашнее задание предыдущего урока.
Теперь надо создать свои классы исключений на каждую ситуацию:
- Проверить содержит ли номер документа последовательность abc.
- Проверить начинается ли номер документа с последовательности 555.
- Проверить заканчивается ли номер документа на последовательность 1a2b.
Если номер документа не удовлетворяет условию - то "бросить" исключение.
B методе класса, в котором будут вызываться эти методы для
демонстрации работы, перехватить исключение конструкцией try-catch и
в блоке catch вывести сообщение для пользователя (сообщение на
консоль).
     */
    }
}
